# Chapter 7

In [8]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
data = pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

the two inputs above come out with the same result

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA,NA,NA],[NA,6.5,3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis = 1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7,3))

In [22]:
df.iloc[:4,1] = NA

In [23]:
df.iloc[:2, 2] = NA

In [24]:
df

          0         1         2
0 -2.013746       NaN       NaN
1  0.507749       NaN       NaN
2  1.264971       NaN  1.016375
3  1.568238       NaN  0.678638
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [25]:
df.dropna()

          0         1         2
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [26]:
df.dropna(thresh=2)

          0         1         2
2  1.264971       NaN  1.016375
3  1.568238       NaN  0.678638
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [28]:
df.fillna(0)

          0         1         2
0 -2.013746  0.000000  0.000000
1  0.507749  0.000000  0.000000
2  1.264971  0.000000  1.016375
3  1.568238  0.000000  0.678638
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -2.013746  0.500000  0.000000
1  0.507749  0.500000  0.000000
2  1.264971  0.500000  1.016375
3  1.568238  0.500000  0.678638
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [31]:
_ = df.fillna(0, inplace=True)

In [32]:
df

          0         1         2
0 -2.013746  0.000000  0.000000
1  0.507749  0.000000  0.000000
2  1.264971  0.000000  1.016375
3  1.568238  0.000000  0.678638
4  0.978338 -1.425057 -0.170647
5  0.815320  1.329463 -0.854967
6 -0.449556 -0.413226  1.033726

In [33]:
df = pd.DataFrame(np.random.randn(6,3))

In [34]:
df.iloc[2:,1] = NA

In [35]:
df.iloc[4:, 2] = NA

In [36]:
df.fillna(method = 'ffill')

          0         1         2
0  1.352193 -0.401276 -1.312880
1 -0.088405 -0.212023 -0.011929
2  0.621164 -0.212023  1.810067
3 -0.155510 -0.212023  0.353970
4  0.428310 -0.212023  0.353970
5  1.033992 -0.212023  0.353970

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.352193 -0.401276 -1.312880
1 -0.088405 -0.212023 -0.011929
2  0.621164 -0.212023  1.810067
3 -0.155510 -0.212023  0.353970
4  0.428310       NaN  0.353970
5  1.033992       NaN  0.353970

In [38]:
data = pd.Series([1., NA, 3.5, NA , 7])

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [40]:
data = pd.DataFrame({'k1':['one', 'two']* 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [46]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

IF YOU DO NOT PUT THE PARENS....IT WILL SHOW RAW DATA

In [47]:
data.drop_duplicates

<bound method DataFrame.drop_duplicates of     k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4>

In [48]:
data['v1'] = range(7)

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                        'Pastrami', 'corned beef', 'Bacon',
                        'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
    
}

In [58]:
lowercased = data['food'].str.lower()

In [59]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [60]:
data['animal']= lowercased.map(meat_to_animal)

In [61]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [62]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [63]:
data = pd.Series([1.,-999., 2., -999., -1000., 3.])

In [64]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace([-999. -1000], np.nan)

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [73]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [76]:
transform = lambda x: x[:4].upper()

In [77]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [78]:
data.index = data.index.map(transform)

In [79]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

RENAMING DATA ^^^^^^^

In [82]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [83]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [84]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [85]:
bins = [18, 25, 35, 60, 100]

In [86]:
cats = pd.cut(ages, bins)

In [87]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [88]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [89]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [90]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [91]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [96]:
group_names = ['Youth', 'Young Adult', 'MiddleAged', 'Senior']

In [98]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'Young Adult', 'Youth', ..., 'Young Adult', 'Senior', 'MiddleAged', 'MiddleAged', 'Young Adult']
Length: 12
Categories (4, object): ['Youth' < 'Young Adult' < 'MiddleAged' < 'Senior']

In [99]:
data = np.random.rand(20)

In [100]:
pd.cut(data, 4, precision=2)

[(0.42, 0.59], (0.077, 0.25], (0.59, 0.77], (0.077, 0.25], (0.077, 0.25], ..., (0.077, 0.25], (0.42, 0.59], (0.59, 0.77], (0.42, 0.59], (0.077, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.077, 0.25] < (0.25, 0.42] < (0.42, 0.59] < (0.59, 0.77]]

In [101]:
data = np.random.randn(1000)

In [102]:
cats = pd.qcut(data, 4)

In [103]:
cats

[(0.739, 2.954], (-0.657, 0.036], (-0.657, 0.036], (-0.657, 0.036], (-3.448, -0.657], ..., (0.036, 0.739], (-0.657, 0.036], (0.739, 2.954], (0.739, 2.954], (0.739, 2.954]]
Length: 1000
Categories (4, interval[float64]): [(-3.448, -0.657] < (-0.657, 0.036] < (0.036, 0.739] < (0.739, 2.954]]

In [104]:
pd.value_counts(cats)

(-3.448, -0.657]    250
(-0.657, 0.036]     250
(0.036, 0.739]      250
(0.739, 2.954]      250
dtype: int64

In [105]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.305, 2.954], (-1.283, 0.036], (-1.283, 0.036], (-1.283, 0.036], (-1.283, 0.036], ..., (0.036, 1.305], (-1.283, 0.036], (1.305, 2.954], (1.305, 2.954], (1.305, 2.954]]
Length: 1000
Categories (4, interval[float64]): [(-3.448, -1.283] < (-1.283, 0.036] < (0.036, 1.305] < (1.305, 2.954]]

In [106]:
data = pd.DataFrame(np.random.randn(1000,4))

In [107]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016691    -0.034260     0.062370    -0.074085
std       0.950607     0.986764     0.989946     0.977359
min      -2.975615    -3.295787    -2.738941    -3.576713
25%      -0.665670    -0.703464    -0.612011    -0.753563
50%       0.010504    -0.031885     0.105390    -0.048928
75%       0.626166     0.636769     0.727890     0.586114
max       3.046764     3.261897     2.883036     3.649335

In [108]:
col = data[2]

In [109]:
col[np.abs(col)> 3]

Series([], Name: 2, dtype: float64)

In [111]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
154 -2.275557  3.066004  1.206213 -0.028531
200  0.614260  3.117327  1.229169  0.459581
207 -0.547648 -3.163830  0.081898 -1.098439
271 -1.909462  0.068190  0.661214  3.649335
319  3.046764 -2.166760 -1.305421  0.972859
327 -0.543020  0.648122  0.215620 -3.106211
765  0.100793  3.261897  0.148650  1.165523
773 -0.610343  0.418501  0.343422 -3.576713
838  1.994287 -3.224255  0.136474  0.523767
886  0.158888 -3.295787  0.294611 -0.879423

In [112]:
data[np.abs(data)> 3] = np.sign(data) *3

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016738    -0.034022     0.062370    -0.074051
std       0.950457     0.983202     0.989946     0.972866
min      -2.975615    -3.000000    -2.738941    -3.000000
25%      -0.665670    -0.703464    -0.612011    -0.753563
50%       0.010504    -0.031885     0.105390    -0.048928
75%       0.626166     0.636769     0.727890     0.586114
max       3.000000     3.000000     2.883036     3.000000

In [114]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0  1.0 -1.0 -1.0

In [115]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [117]:
sampler = np.random.permutation(5)

In [118]:
sampler

array([0, 4, 1, 2, 3])

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [121]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [122]:
choices = pd.Series([5,7,-1,6,4])

In [123]:
draws = choices.sample(n=10, replace=True)

In [124]:
draws

4    4
4    4
3    6
0    5
0    5
4    4
0    5
2   -1
0    5
0    5
dtype: int64

In [125]:
df = pd.DataFrame({'key': ['b','b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})

In [126]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [127]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [128]:
df_with_dummy = df[['data1']].join(dummies)

In [129]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [130]:
mnames = ['movie_id', 'title', 'genres']

In [137]:
import regex as repr

In [138]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
header=None, names=mnames)

<ipython-input-138-b36f9f75350d>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

MISSING FOLDER OVER HERE. CANT CLONE WILL MESS UP ME STUFF.

In [139]:
np.random.seed(12345)

In [140]:
values = np.random.rand(10)

In [141]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [142]:
bins = [0,0.2,0.4, 0.6,0.8,1]

In [143]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [153]:
val = 'a,b, guido'

In [154]:
val.split(',')

['a', 'b', ' guido']

In [155]:
pieces = [x.strip() for x in val.split(',')]

In [147]:
pieces

['a', 'b guido']

In [156]:
first, second, third, = pieces

In [157]:
first + '::' + second + '::' + third

'a::b::guido'

In [158]:
'::'.join(pieces)

'a::b::guido'

In [159]:
'guido' in val

True

In [160]:
val.index

In [161]:
val.find(':')

-1

In [162]:
val.index(':')

ValueError: substring not found

In [166]:
val.count(',')

2

In [167]:
val.replace(',','')

'ab guido'

In [168]:
import re

In [169]:
text = "foo bar\t baz \tqux"

In [170]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [172]:
regex = re.compile('\s+')

In [173]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [174]:
regex.findall(text)

[' ', '\t ', ' \t']

In [176]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [177]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [178]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [179]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [180]:
m = regex.search(text)

In [181]:
m

In [182]:
text[m.start():m.end()]

'dave@google.com'

In [183]:
print(regex.match(text))

None

In [184]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [186]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [188]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [189]:
m = regex.match('wesm@bright.net')

In [190]:
m.groups()

()

In [191]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [193]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3, text'))
Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: google, Suffix: com
Rob Username: rob, Domain: google, Suffix: com
Ryan Username: ryan, Domain: google, Suffix: com

SyntaxError: invalid syntax (<ipython-input-193-56cc416ed54c>, line 2)

In [194]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
                'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [195]:
data = pd.Series(data)

In [196]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [197]:
data.isnull

<bound method Series.isnull of Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object>

In [198]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [199]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [200]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [202]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [203]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [206]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [208]:
matches.str[:5]

AttributeError: Can only use .str accessor with string values!